# CreateRenderBkg

## Description
```pascal
FUNCTION CreateRenderBkg(Background : INTEGER) : HANDLE;
```

```python

def vs.CreateRenderBkg(Background):
    return HANDLE
```

## Parameters
|Name|Type|Description|
|---|---|---|
|Background|INTEGER|Background is the type of background the function should rerturn.        0 returns a background with no shader attached.    1 returns a cloud background    2 returns a one color background    3 returns a two color background    4 returns a physical sky background. |

## Version
Availability: from Vectorworks 2013
## Category
* Objects - 2D